Documents/ЭкзаменыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЭкзаменыПродавцов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуВидео</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросовВЭкзамене</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВерныхОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОпросникДляЭкзаменацииПродавца</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравильныйОтвет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВопросовВЭкзамене</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидеоЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуВидео</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЭкзаменыПродавцов/Forms/ФормаПодбораЭкзаменуемогоДляСтажера/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОпроса = НачалоДня(ТекущаяДата());
	ФильтрНомерСмены = 5;
	ФильтрНомерСменыПо = 8;
	Кандидаты.Параметры.УстановитьЗначениеПараметра("ДатаОпроса", ДатаОпроса);
	//Кандидаты.Параметры.УстановитьЗначениеПараметра("Продавец"	, Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Продавец-консультант"));
	//Кандидаты.Параметры.УстановитьЗначениеПараметра("Кассир"	, Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Кассир"));
	Кандидаты.Параметры.УстановитьЗначениеПараметра("Стажер"	, Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Стажер"));
	
	//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ДатаОпроса"	, ДатаОпроса);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСмены",ФильтрНомерСмены,ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,ФильтрНомерСмены<>0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСменыПо",ФильтрНомерСменыПо,ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,ФильтрНомерСменыПо<>0);
	
	ФильтрПоТочкеПриИзмененииСервер();
	
КонецПроцедуры


Процедура ФильтрПоТочкеПриИзмененииСервер()
	
	Кандидаты.Параметры.УстановитьЗначениеПараметра("ФильтрПоТочке"				, ФильтрПоТочке);
	//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ФильтрПоТочке"		, ФильтрПоТочке);
	
	
	Если ЗначениеЗаполнено(ФильтрПоТочке) Тогда
		Кандидаты.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"			, Ложь);
		//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"	, Ложь);
	
	Иначе
		Кандидаты.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"			, Истина);
		//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"	, Истина);
	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ФильтрПоТочкеПриИзменении(Элемент)
	
	ФильтрПоТочкеПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КандидатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Кандидаты.ТекущиеДанные;
	Если Вопрос("Создать экзамен для " + ТекДанные.Продавец + " ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Парам = Новый Структура;
		Парам.Вставить("Продавец"			, ТекДанные.Продавец);
		Парам.Вставить("Точка"				, ТекДанные.ТорговаяТочка);
		Парам.Вставить("Свойство"			, ТекДанные.Свойство);
		Парам.Вставить("Должность"			, ТекДанные.Должность);
		Парам.Вставить("ВопросовВЭкзамене"	, ТекДанные.ВопросовВЭкзамене);
		ОткрытьФормуМодально("Документ.ЭкзаменыПродавцов.Форма.ФормаДокумента", Парам);
		//Элементы.Кандидаты.Обновить();
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаОпросаПриИзменении(Элемент)
	
	Кандидаты.Параметры.УстановитьЗначениеПараметра("ДатаОпроса"			, ДатаОпроса);
	//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ДатаОпроса"	, ДатаОпроса);

	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрНомерСменыПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСмены",ФильтрНомерСмены,ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,ФильтрНомерСмены<>0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСменыПо",ФильтрНомерСменыПо,ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,ФильтрНомерСменыПо<>0);
КонецПроцедуры
